evgmolt/Tonometer/gd32f303_v1/src/main.c
    nvic_irq_enable(USART1_IRQn, 0, 0);             // UART1
    usart_config_1();                               // UART1
    usart_interrupt_enable(USART1, USART_INT_RBNE); // UART1
    
    nvic_irq_enable(USART0_IRQn, 0, 0);             // UART0
    usart_config_0();                               // UART0
    usart_interrupt_enable(USART0, USART_INT_RBNE); // UART0
        
    //while (USBD_CONFIGURED != usbd_cdc.cur_status) {/* wait for standard USB enumeration is finished */}    
        
    ILI9341_Init();
    ILI9341_Touch_init();       
    
    if (mode == USB_CHARGING)
    {
        ILI9341_FillScreen(ILI9341_BLACK);
        print_battery();
    }
    else ILI9341_FillScreen(ILI9341_WHITE);
    
    ButtonInterruptConfig();

    rate = ReadRateFromFmc();
//    rate = 18.1;    

    Timer1Start();
    
    button_released = 0;
    button_pressed_counter = 0;
    byte_num = 0;
    num_of_packet = 0;
    current_packet_num = 0;
    checksum = 0;
    
    if (mode == INIT_START)
    {
        PrintHeart(true);
        PrintBluetooth(true);
        PrintGsm(true);
        PrintHeartX3(true);
        PrintSYS_label(true);
        PrintDIA_label(true);
        PrintNum(888, BIG_NUM_RIGHT, SYS_TOP, YELLOW);
        PrintNum(888, BIG_NUM_RIGHT, DIA_TOP, RED);
        PrintNum(888, BIG_NUM_RIGHT, PULSE_TOP, BLACK);        
    }
    else if (mode == PRESSURE_TEST)
    {
        ILI9341_FillRectangle(70, 150, 100, 50, ILI9341_WHITE);
    }    
        
    if (sim800_FLAG) {}      //GSM module ...        
    delay_1ms(1000);
    if (mode != USB_CHARGING) 
    {            
        ClearScreen();
    }        
        
    i2cCalibration();    

    
//    FmcSerialCheck();
    delay_1ms(200);
    memset(UART0_buff, 0, 200);
    /* PMU lock enable */
    rcu_periph_clock_enable(RCU_PMU); 
    /* BKP clock enable */
    rcu_periph_clock_enable(RCU_BKPI);
    /* enable write access to the registers in backup domain */
    pmu_backup_write_enable();
    /* clear the bit flag of tamper event */
    bkp_flag_clear(BKP_FLAG_TAMPER); 
    
    SIM800_PWRKEY_UP;
    SIM800_EXT_DOWN;
    delay_1ms(200);
    SIM800_PWRKEY_DOWN;
    delay_1ms(6);
    SIM800_EXT_UP;
    delay_1ms(100);
    SIM800_PWRKEY_UP;
    delay_1ms(100);   
    
#ifndef DEBUG    
    fwdgt_prescaler_value_config(FWDGT_PSC_DIV64);
    fwdgt_enable();
#endif
//    CreateJSON();
    while (1) 
    {    
        fwdgt_counter_reload();
        switch (mode)
        {
            case INIT_START:
                if (!button_pressed) 
                {
                    mode = START_SCREEN;
                    button_released = 0;
                    button_pressed_counter = 0;                    
                }
                break;
            case START_SCREEN:
                BluetoothCheck();
                TFT_print();
// Переход в режим зарядки при подключении USB разъема      
#ifndef DEBUG            
                if (gpio_input_bit_get(GPIOC, GPIO_PIN_10))
                {
                    ILI9341_FillScreen(ILI9341_BLACK);
                    print_battery();
                    mode = USB_CHARGING;
                }
#endif
                if (button_released) 
                {
                    view_time = 0;
                    send_buf_UART_1("AT\r", 3);            
                    
                    ILI9341_FillRectangle(0, 0, 240, 280, ILI9341_WHITE);                            
                    ILI9341_FillRectangle(100, 270, 140, 50, ILI9341_WHITE);                        
                
                    count_send_bluetooth=0;
                
                    current_pressure=0;
                    i2cCalibration();
                    PUMP_ON;
                    VALVE_FAST_CLOSE;
                    VALVE_SLOW_CLOSE;
                    lock_interval=50;
                    ResetDetector();
                    puls_counter=0;            
                    Timer2Start();
                    stop_meas = false;
                    mode = PUMPING_MANAGEMENT;
                    button_released = 0;
                    button_pressed_counter = 0;
                }
                break;
            case KEY_OFF:
                DeviceOff();
                break;
            case PUMPING_MANAGEMENT:
                BluetoothCheck();
                shutdown_counter = 0;
                ILI9341_FillRectangle(65, 245, 45, 27, ILI9341_WHITE);
                if (button_released) AbortMeas();
                if (show_pressure_counter == 0)
                {
                    show_pressure_counter = SHOW_PRESSURE_INTERVAL;
                    if (current_pressure >= 0 & current_pressure<400) PrintNum(current_pressure, BIG_NUM_RIGHT, DIA_TOP, GREEN);
                }
                            
                if (current_pressure >= MAX_ALLOWED_PRESSURE && process_counter > MIN_PUMPING_INTERVAL) 
                {
                    ResetDetector();
                    puls_counter=0;      
                    stop_meas = false;
                    PUMP_OFF;
                    VALVE_SLOW_OPEN;
                    mode = MEASUREMENT;        
                }                        
                break;
            case USB_CHARGING:
                shutdown_counter = 0;
                if (gpio_input_bit_get(GPIOB, GPIO_PIN_8)==0) indicate_charge_toggle=1; //Не работает
                PrintBattCharge();                
                delay_1ms(1500);                
                if (gpio_input_bit_get(GPIOC, GPIO_PIN_10)==0) DeviceOff();                        
                break;
            case PRESSURE_TEST:
                shutdown_counter = 0;
                convert_NO_save();
                PrintNum(current_pressure, BIG_NUM_RIGHT, DIA_TOP, GREEN);
                usb_send_16(i2c_out,0);
                delay_1ms(200);
                PrintTime(rtc_counter_get());
                if (usb_command == USB_COMMAND_SET_RATE)
                {   
                    rate = rate_whole + rate_fract / 100;
                }
                break;
            case MEASUREMENT:
                shutdown_counter = 0;
                if (button_released) AbortMeas();
                if (show_pressure_counter == 0)
                {
                    show_pressure_counter = SHOW_PRESSURE_INTERVAL;
                    if (current_pressure>=0 & current_pressure<400) PrintNum(current_pressure, BIG_NUM_RIGHT, DIA_TOP, GREEN);
                }
                if (ble_data_ready)
                {                        
                    ble_data_ready = false;
                    uint8_t c_summ=0;                            
                    uint8_t cur_buff_ble[400]={'0', '2', 0x05, count_send_bluetooth & 0xFF, (count_send_bluetooth>>8) & 0xFF, BLE_PACKET_SIZE};
                    
                    for (int f = 0; f < BLE_PACKET_SIZE; f++)
                    {
                        int16_t cur_press = ble_buffer[f];
                        cur_buff_ble[6 + f * 2] = cur_press & 0xFF;
                        cur_buff_ble[6+f*2+1] = (cur_press >> 8) & 0xFF;
                    }                            
                    for (int f=0; f < BLE_PACKET_SIZE * 2 + 6; f++)
                    {
                        c_summ+=cur_buff_ble[f];
                    }
                    cur_buff_ble[BLE_PACKET_SIZE * 2 + 6] = c_summ;
                    send_buf_UART_0(cur_buff_ble, BLE_PACKET_SIZE * 2 + 6 + 1);
                    count_send_bluetooth++;
                }
                if (current_pressure <= STOP_MEAS_LEVEL || stop_meas)
                {
                    total_size = main_index;
                    current_max=0;        
                    global_max=0;        
                    detect_level=detect_level_start;
                    silence_time_start=0;
                    puls_counter=0;            

